// chapt3_dataTyep.js
// 자료형(data type)
// 프로그래밍을 하면서 다루게 되는 여러 정보, 값들의
// 형태를 정해놓은 것으로,
// 크게 세 가지로 나뉜다.
// - 숫자형 Number
//      - 정수 1, 3, 0, -99
//      - 실수 1.0, 3.9, 3.141592, -19.31
// - 문자형 String
//      - 작은따옴표', 큰따옴표" 혹은 백틱`으로 감싼 값을
//          텍스트 데이터로 취급한다. 이를 문자열이라고 부른다.
// - 논리형 Boolean
//      - 참과 거짓만 존재하는 자료형으로
//          true와 false만 존재한다.
//      - 기계어와 1대1 대응되는 자료형이다.(0, 1)

// - null, undefined
// null은 값이 없음을 명시적으로 작성해놓은 것이다.(참조 없음)
// undefined는 변수를 선언했지만 값을 할당하거나
// 초기화하지 않은 상태를 의미한다.
